'''
1.1
1) Установите Python и PyCharm
2) Напишите и запустите программу. которая выводит строку "Hello world!";
3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную
user_name и выводит строку "Hello {user_name}!"
1.2
'''
print('Hello world')

print(f"Hello {input().capitalize()}!")

'''
1) Напишите программу, чтобы вывести:
*********
*       *
*       *
*********
'''
print('*'*9)
print('*'+' '*7+'*')

print('*'+' '*7+'*')
print('*'*9)

